demo0/ns_eqn_parabolic/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3773
(
0.00162211
0.000940551
0.000535287
0.000340569
0.000284834
0.000308081
0.000344844
0.000359853
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<scalar> 
49
(
0.00204082
0.00612245
0.0102041
0.0142857
0.0183673
0.022449
0.0265306
0.0306122
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
77
(
-0.000420206
-0.00110699
-0.00151661
-0.00171533
-0.0017752
-0.00175664
-0.00172551
-0.00171715
...
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<scalar> 
77
(
0.199865
0.199696
0.199721
0.199922
0.200276
0.200763
0.201357
0.202027
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
49
(
0.0274632
0.0322367
0.0370102
0.0417837
0.0465573
0.0513309
0.0561044
0.0608741
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
