demo0/ns_eqn_parabolic/0/HanGaoBCFaceVector
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      HanGaoBCFaceVector;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<vector> 
49
(
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
(0 -3.91049e-05 0)
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
77
(
(-4.96742e-05 -8.05173e-06 0)
(-5.00626e-05 -5.10796e-06 0)
(-5.02478e-05 -2.74099e-06 0)
(-5.03112e-05 -1.06669e-06 0)
(-5.03224e-05 -8.04736e-08 1.65436e-24)
(-5.03206e-05 4.36111e-07 0)
(-5.03222e-05 1.60289e-07 -3.30872e-24)
(-5.03225e-05 8.62262e-14 0)
...
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<vector> 
77
(
(4.04583e-05 2.58915e-06 0)
(4.05359e-05 6.47347e-07 1.32349e-23)
(4.05254e-05 -1.12638e-06 0)
(4.04489e-05 -2.73184e-06 0)
(4.03382e-05 -4.05e-06 0)
(4.01951e-05 -5.2844e-06 0)
(4.00801e-05 -6.09592e-06 0)
(3.9978e-05 -6.73283e-06 1.05879e-22)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
49
(
(1.32937e-05 4.57335e-05 2.11758e-22)
(1.32939e-05 4.57334e-05 0)
(1.32939e-05 4.57334e-05 0)
(1.3293e-05 4.57337e-05 -2.11758e-22)
(1.32915e-05 4.57341e-05 0)
(1.32915e-05 4.57341e-05 0)
(1.32915e-05 4.57341e-05 0)
(1.35457e-05 4.56595e-05 -2.11758e-22)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
