demo0/ns_eqn_parabolic/0/S
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<symmTensor> 
3773
(
(0 0 0 -193.016 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
49
(
(0 0 0 -386.298 0 0)
(0 0 0 -387.687 0 0)
(0 0 0 -389.089 0 0)
(0 0 0 -390.503 0 0)
(0 0 0 -391.93 0 0)
(0 0 0 -393.371 0 0)
(0 0 0 -394.825 0 0)
(0 0 0 -396.293 0 0)
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
77
(
(0 15.2426 0 -188.075 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
...
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
77
(
(0 7.51822 0 -234.961 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
...
)
;
    }
    up
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
