demo0/ns_eqn_parabolic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    low
    {
        type            fixedValue;
        value           nonuniform List<vector> 
49
(
(0 0.04039990537276 0)
(0 0.11870056059975 0)
(0 0.19366963431900003 0)
(0 0.26530587755100005 0)
(0 0.333610229071 0)
(0 0.3985842399 0)
(0 0.46022472636399997 0)
(0 0.518533321116 0)
...
)
;
    }

    rifht
    {
        type            noSlip;
    }

    up
    {
        type            zeroGradient;
    }

    left
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
