demo0/ns_eqn_parabolic/0/div(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      div(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3773
(
(0 66883.4 0)
(0 -11.4203 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;

boundaryField
{
    low
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
49
(
(0 66883.4 0)
(0 75188.2 0)
(0 75732.8 0)
(0 76284.4 0)
(0 76843.1 0)
(0 77409.1 0)
(0 77982.5 0)
(0 78563.4 0)
...
)
;
    }
    left
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
77
(
(0 66883.4 0)
(0 -11.4203 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    rifht
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
77
(
(0 115400 0)
(0 -6.61065 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    up
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
