demo0/ns_eqn_parabolic/0/gradKSqrt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      gradKSqrt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    low
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    left
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    rifht
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    up
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
