demo0/ns_eqn_parabolic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    low
    {
        type            wall;
        inGroups        1(wall);
        nFaces          49;
        startFace       7420;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          77;
        startFace       7469;
    }
    rifht
    {
        type            wall;
        inGroups        1(wall);
        nFaces          77;
        startFace       7546;
    }
    up
    {
        type            wall;
        inGroups        1(wall);
        nFaces          49;
        startFace       7623;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7546;
        startFace       7672;
    }
)

// ************************************************************************* //
